jch12138/nrf52840_rtt/packages/nrf5x_sdk-latest/rtt_adapter/ble_app_uart.c
/*
 * Copyright (c) 2006-2020, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2020-07-23     supperthomas first version
 *
 */

#include <rtthread.h>
#include <rtdevice.h>
#include <drivers/serial.h>

#include "sdk_config.h"
#include "nordic_common.h"
#include "nrf_soc.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "ble_advdata.h"
#include "app_error.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_nus.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "ble_conn_params.h"
#include "ble_advertising.h"
#include "ipc/ringbuffer.h"

#define DBG_SECTION_NAME "BLE"
#define DBG_COLOR
#define DBG_LEVEL DBG_LOG
#include <rtdbg.h>


#include <dfs_posix.h>
#include "math.h"
#include <stdio.h>

#define PI 3.14159


#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */

#define DEVICE_NAME                     "Pluse_WJH"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                18000                                       /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                256                                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                256                                         /**< UART RX buffer size. */



//#define NRF_LOG_ERROR(...)                     rt_kprintf(__VA_ARGS__)
//#define NRF_LOG_WARNING(...)                   rt_kprintf( __VA_ARGS__)
//#define NRF_LOG_INFO(...)                      rt_kprintf( __VA_ARGS__)
//#define NRF_LOG_DEBUG(...)                     rt_kprintf( __VA_ARGS__)

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static struct rt_ringbuffer ringbuffer_handler;
static rt_uint8_t ringbuffer[1024] = {0};
static rt_device_t serial;
#define UART_NAME       "uart0"      /* 串口设备名称 */

extern rt_uint32_t result1,result2,result3;//ADC采样值
extern rt_adc_device_t adc_dev;
rt_uint8_t  result[6];

int fd,size;
char file_name[20] = "0000000000000.hex"; 	//记录数据的文件名
char time_stamp[14]= "0000000000000"; 					    //采样开始时的时间戳

static struct rt_ringbuffer ringbuffer_putc_handler;
static rt_uint8_t ringbuffer_putc[1024] = {0};
static rt_thread_t savedate = NULL;
static rt_thread_t sendfile = NULL;
static rt_thread_t senddata = NULL;

/*
实现蓝牙串口的打印
*/
ret_code_t ble_printf(const char *fmt, ...)
{
    ret_code_t ret = NRF_SUCCESS;
    va_list args;
    rt_uint16_t length;
    static char rt_log_buf[255];

    va_start(args, fmt);

    length = rt_vsnprintf(rt_log_buf, sizeof(rt_log_buf) - 1, fmt, args);

    ret = ble_nus_data_send(&m_nus, rt_log_buf, &length, m_conn_handle);

    va_end(args);

    return ret;
}

//文件传输测试

int ble_file_transfer_test(int argc, char **argv)
{
    ret_code_t err_code;

    int ret;
    int fd;            /* 文件指针 */
    struct stat buf;   /* 文件状态 */
    char filename[20]; /* 文件名 */
    uint16_t data_size,send_size;
    uint8_t buffer[256]; /* 发送缓存 */

    if (argc == 1)
    {
        rt_strncpy(filename, "/file.txt", 9);
        filename[9] = '\0';
    }
    if (argc == 2)
    {
        rt_strncpy(filename, argv[1], rt_strlen(argv[1]));
        filename[rt_strlen(argv[1])] = '\0';
    }

    ret = stat(filename, &buf);
    if (ret == 0)
    {
        rt_kprintf("%s file size = %d\n", filename, buf.st_size);
    }
    else
    {
        rt_kprintf("%s not found\n", filename);
        return 0;
    }

