jch12138/nrf52840_rtt/packages/nrf5x_sdk-latest/rtt_adapter/ble_app_uart.c
    ble_printf("filesize:%dbytes\r\n", buf.st_size);

    fd = open(filename, O_RDONLY);

    if (fd >= 0)
    {
        while (true)
        {
            data_size = read(fd, buffer, m_ble_nus_max_data_len);
            if(data_size == 0)
            {
                break;
            }

            for (int i = 0; i < data_size; i++)
            {
                rt_kprintf("%x ", buffer[i]);
            }

            rt_kprintf("\r\n");

//            buffer[data_size] = '\r';
//            buffer[data_size + 1] = '\n';

//            send_size = data_size +2;
           
            do
            {
                err_code = ble_nus_data_send(&m_nus, buffer, &data_size, m_conn_handle);
            } while (err_code != NRF_SUCCESS);

            
        }

        close(fd);
    }

    ble_printf("file transfer end\r\n");
}
MSH_CMD_EXPORT(ble_file_transfer_test, ble send file test);

/**@brief Function for saveadcvalue.
 *

 */
static void save_adcdate(void *param)
{
        result1 = rt_adc_read(adc_dev, 5);
        result2 = rt_adc_read(adc_dev, 6);
        result3 = rt_adc_read(adc_dev, 7);
        rt_kprintf("%d %d %d \r\n",result1,result2,result3);
        result[0] = (result1>>8)&0xff;
        result[1] =  result1&0xff;
        result[2] = (result2>>8)&0xff;
        result[3] =  result2&0xff;
        result[4] = (result3>>8)&0xff;
        result[5] =  result3&0xff;
        rt_kprintf("%d %d %d %d %d %d \r\n",result[0],result[1],result[2],result[3],result[4],result[5]);
        write(fd,result,6);
        rt_kprintf("writesuccesss\r\n");

}

static void adc_data()
{
    int virtual_value[3];
    float t=0;

    uint8_t buf[30];
    uint16_t m=0;
    uint16_t length = 30;
    
    while (1)
    {
//         result1 = rt_adc_read(adc_dev, 5);
//         result2 = rt_adc_read(adc_dev, 6);
//         result3 = rt_adc_read(adc_dev, 7);
//         virtual_value[0] = (int)(sin(2*PI*t/10)*1000);
//         virtual_value[1] = (int)(sin(2*PI*t/10+PI/4)*1000);
//         virtual_value[2] = (int)(sin(2*PI*t/10+PI/2)*1000);
//         ble_printf("data:%d,%d,%d\r\n",virtual_value[0],virtual_value[1],virtual_value[2]);
//         rt_kprintf("data:%d,%d,%d\r\n",virtual_value[0],virtual_value[1],virtual_value[2]);
//         t++;
//        
//         rt_thread_mdelay(20);


        for(int i=0;i<5;i++)
        {
            buf[6*i] = m>>8;
            buf[6*i+1] = m&0xff;
            buf[6*i+2] = m>>8;
            buf[6*i+3] = m&0xff;
            buf[6*i+4] = m>>8;
            buf[6*i+5] = m&0xff;
//            m++;
						t=t+0.5;
					  m = (int)(sin(t)*500);
						rt_kprintf("data: %d\r\n",m);
        }
//        if(m>500)
//        {
//            m=0;
//        }
        ble_nus_data_send(&m_nus, buf, &length, m_conn_handle);
        
        rt_thread_mdelay(500);
    }

}

int adc_data_thread(void)
{
    senddata = rt_thread_create("senddate",
                        adc_data, RT_NULL,
                        2048,
                        8, 20);
    if (senddata != RT_NULL)
                rt_thread_startup(senddata);
    return RT_EOK;

}
//INIT_APP_EXPORT(adc_data_thread);
MSH_CMD_EXPORT(adc_data_thread, send_data);
/**@brief Function for transfor adcvalue history.
 *
 */

static void read_fname(void *param)
{
    DIR *dirp;
    struct dirent *dp;
    /* 打开根目录 */
    rt_kprintf("the directory is:\n");
    dirp = opendir("/");
    for (dp = readdir(dirp); dp != RT_NULL; dp = readdir(dirp))
    {          
        rt_kprintf("%s\n", dp->d_name);
    }
}
MSH_CMD_EXPORT(read_fname, readfilename)
/**@brief Function for transforadcvalue ontime.
 *
 */
static void send_adcdata_ol(void *param)
{
    result1 = rt_adc_read(adc_dev, 5);
//        rt_kprintf("saadc channel 0 value = %d, ",result); 
    result2 = rt_adc_read(adc_dev, 6);
//       rt_kprintf("saadc channel 1 value = %d \n",result);
    result3 = rt_adc_read(adc_dev, 7);
//        rt_kprintf("saadc channel 5 value = %d",result);  
    result[0] = (result1>>8)&0xff;
    result[1] =  result1&0xff;
    result[2] = (result2>>8)&0xff;
    result[3] =  result2&0xff;
    result[4] = (result3>>8)&0xff;
    result[5] =  result3&0xff;
	ble_printf("data:%d,%d,%d \n",result1,result2,result3);
    uint16_t len = 6;
    //·ble_nus_data_send(&m_nus, result,&len , m_conn_handle);
}
/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 *
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
         //   err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
            // LED indication will be changed when advertising starts.
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}

static void ble_stack_init(void)
{
    ret_code_t err_code;
    uint32_t ram_start = 0;
    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.

    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);
    
    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
          //  err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
          //  sleep_mode_enter();
            break;
        default:
            break;
    }
}
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

