jch12138/nrf52840_rtt/packages/nrf5x_sdk-latest/rtt_adapter/ble_app_uart.c
}


/**@snippet [Handling the data received over BLE] */

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
   // APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}
/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = 20000;//FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = 5000;//NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


static int ble_app_init(void)
{
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    LOG_I("BLE started.");
    advertising_start();
    //上面是初始化蓝牙协议栈，下面是将本地串口与蓝牙串口连接
    rt_ringbuffer_init(&ringbuffer_handler, ringbuffer, sizeof(ringbuffer));
    rt_ringbuffer_init(&ringbuffer_putc_handler, ringbuffer_putc, sizeof(ringbuffer_putc));
    serial = rt_device_find(UART_NAME);
    if (!serial)
    {
        rt_kprintf("find %s failed!\n", UART_NAME);
        return -RT_ERROR;
    }
		
}
MSH_CMD_EXPORT(ble_app_init, ble app start);
INIT_APP_EXPORT(ble_app_init);

int uart_putc_hook(rt_uint8_t *ch)
{
    rt_ringbuffer_putchar(&ringbuffer_putc_handler, *ch);
    return 0;
}


//实时传输开始
int hrs_tf_on(void)
{
    senddata = rt_thread_create("senddate",
                        adc_data, RT_NULL,
                        2048,
                        8, 20);
    if (senddata != RT_NULL)
                rt_thread_startup(senddata);
    return RT_EOK;

}

MSH_CMD_EXPORT(hrs_tf_on, transport realtime);
//实时传输结束
int hrs_tf_off(void)
{
    if(senddata)
    {
        rt_thread_delete(senddata);
    }
    
    return RT_EOK;
}
MSH_CMD_EXPORT(hrs_tf_off, stop transport);

//存数据测试
int savetest(void)
{

    fd=  open("\hello.hex", O_WRONLY | O_CREAT);
    if(fd>0)
    {
        rt_kprintf("file creat and open successfully\r\n");
    }
    int32_t timestart=rt_tick_get();
    int count = 200;
    while(count)
    {
        count --;
        // result1 = rt_adc_read(adc_dev, 5);
        // result2 = rt_adc_read(adc_dev, 6);
        // result3 = rt_adc_read(adc_dev, 7);
        result1 = 0x3132;
        result2 = 0x3334;
        result3 = 0x3536;
        //rt_kprintf("%d %d %d \r\n",result1,result2,result3);
        result[0] = (result1>>8)&0xff;
        result[1] =  result1&0xff;
        result[2] = (result2>>8)&0xff;
        result[3] =  result2&0xff;
        result[4] = (result3>>8)&0xff;
        result[5] =  result3&0xff;
        //rt_kprintf("%d %d %d %d %d %d \r\n",result[0],result[1],result[2],result[3],result[4],result[5]);
        write(fd,result,6);
        //rt_thread_mdelay(20);
        

    }
    int32_t timestop=rt_tick_get();
    close(fd);
    rt_kprintf("usetime = %d\r\n",timestop-timestart);

}
MSH_CMD_EXPORT(savetest, test adc save to file);

//读测试
int readtest()
{   int size;
    char buffer[40];
    fd=  open("\hello.hex", O_RDONLY);
    size = read(fd, buffer, sizeof(buffer));
    for(int i=0;i<=30;i++)
    {
        rt_kprintf("%d ",buffer[i]);
    }
    rt_kprintf(" \r\nsize=%d",size);
}
MSH_CMD_EXPORT(readtest, test adc read to file);
int stop_save(void)
{

}
MSH_CMD_EXPORT(stop_save, stop_save save adcvalue);

//蓝牙串口发送数据
int ble_uart_send(int argc, char **argv)
{
    char buffer[256];
    uint16_t length;
    char text[15] = "ble uart test\n";

    if (argc == 1)
    {
        // length = rt_strlen(text);
        // ble_nus_data_send(&m_nus, text, &length, m_conn_handle);
 //       ble_printf("data:%d,%d,%d,%d,%d,%d,%d,%d\r\n", channel_data[0], channel_data[1], channel_data[2], channel_data[3], channel_data[4], channel_data[5], channel_data[6], channel_data[7]);
    }

    if (argc == 2)
    {
        length = rt_strlen(argv[1]);
        rt_strncpy(buffer, argv[1], length);
        ble_nus_data_send(&m_nus, buffer, &length, m_conn_handle);
    }

    return 0;
}
MSH_CMD_EXPORT(ble_uart_send, ble uart test)



// int ble_app_uart(void)
// {
//     rt_ringbuffer_init(&ringbuffer_handler, ringbuffer, sizeof(ringbuffer));
//     rt_ringbuffer_init(&ringbuffer_putc_handler, ringbuffer_putc, sizeof(ringbuffer_putc));
//     serial = rt_device_find(UART_NAME);
//     if (!serial)
//     {
//         rt_kprintf("find %s failed!\n", UART_NAME);
//         return -RT_ERROR;
//     }
    
//     static rt_thread_t tid1 = RT_NULL;

//     tid1 = rt_thread_create("softdevice",
//                         ble_app_softdevice, RT_NULL,
//                         4096,
//                         22, 5);
//     if (tid1 != RT_NULL)
//         rt_thread_startup(tid1);

//     tid1 = rt_thread_create("serial_task",
//                         uart_task, RT_NULL,
//                         1024,
//                         22, 5);
//     if (tid1 != RT_NULL)
//     {
//         rt_thread_startup(tid1);
//     }
//     return RT_EOK;
// }
// MSH_CMD_EXPORT(ble_app_uart, ble app uart);

// 发送本地数据至蓝牙串口 无用
// static void uart_task(void *param)
// {
//     uint16_t data_len = 0;
//     uint16_t onece_send_data_len = 50;

//     // 每隔1秒钟， 查询当前putc ringbuffer是否有数据需要发送
//     while (1)
//     {
//         data_len = rt_ringbuffer_data_len(&ringbuffer_putc_handler);
//         if (data_len > 0)
//         {
//             uint8_t *pdata = (uint8_t *)rt_malloc(data_len);
//             if(pdata == NULL)
//             {
//                 rt_kprintf("malloc data failed, malloc len is %d\r\n", data_len);
//             }
//             else
//             {
//                 // 内存分配成功
//                 rt_ringbuffer_get(&ringbuffer_putc_handler, pdata, data_len);

//                 // 将要发送的数据， 分次发送，每次发送onece_send_data_len数据
//                 uint8_t count = 0;
//                 uint16_t remainint_data = 0;
//                 count = data_len / onece_send_data_len;
//                 remainint_data = data_len % onece_send_data_len;

//                 int i = 0;
//                 for (i = 0; i < count; i++)
//                 {
//                     ble_nus_data_send(&m_nus, pdata + i * onece_send_data_len, &onece_send_data_len, m_conn_handle);
//                     rt_thread_mdelay(200);
//                 }
//                 ble_nus_data_send(&m_nus, pdata + i * onece_send_data_len, &remainint_data, m_conn_handle);
//                 rt_thread_mdelay(200);

//                 // 释放内存
//                 if (pdata != NULL)
//                 {
//                     rt_free(pdata);
//                     pdata = NULL;
//                 }
//             }
//         }
//         rt_thread_mdelay(1000);
//     }
    
// }
